app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT `events`.* FROM `events`

  def create
    @event = Event.new(event_params)

    if @event.save
---
INSERT INTO `events` (`name`, `description`, `site_id`, `start_time`, `end_time`, `created_at`, `updated_at`) VALUES ('mi evento', 'Biggest event', 1, '1990-09-09 00:00:00', '1990-09-09 00:00:00', '2017-10-14 18:53:55', '2017-10-14 18:53:55')

  def destroy_by_name
    @del = Event.where(:name => params[:name]).destroy_all
---
DELETE FROM `events` WHERE `events`.`id` = 2
SELECT `events`.* FROM `events` WHERE `events`.`name` = 'mi Evento 2'