app/controllers/sites_controller.rb

  def create
    @site = Site.new(site_params)

    if @site.save
---
INSERT INTO `sites` (`name`, `longitude`, `latitude`, `image`, `created_at`, `updated_at`) VALUES ('León de Greiff', 0.0, 0.0, 'string', '2017-10-14 18:53:51', '2017-10-14 18:53:51')